Repository: pedro-mendonca/dominant-colors-lazy-loading-wordpress-plugin
Catalog: languages/dominant-colors-lazy-loading-*.po
Languages: pt_pt

source: All dominant colors have been calculated successfully.
pt_pt: Todas as cores dominantes foram calculadas com sucesso.

source: All attempts seem to have failed. Please make sure that the attachment files exist.
pt_pt: Todas as tentativas parecem ter falhado. Por favor verifique se os ficheiros dos anexos existem.

source: {{success}} color(s) calculated, but {{error}} attempt(s) failed.
pt_pt: {{success}} cor(es) calculada(s), mas há {{error}} tentativa(s) falhada(s).

source: {{count}} of {{total}} missing dominant colors calculated.
pt_pt: {{count}} de {{total}} sem cor dominante calculada.

source: Calculation for {{attachment}} failed.
pt_pt: Falhou o cálculo de {{attachment}}.

source: Please be patient while the calculation is in progress. This can take a while if your server is slow or if you have many images.
pt_pt: Por favor aguarde enquanto o cálculo é executado. Isto pode demorar um pouco se o seu servidor for lento ou se tiver muitas imagens.

source: An unexpected error has occurred, please reload the page and restart the calculation.
pt_pt: Ocorreu um erro inesperado, por favor carregue a página de novo e reinicie o cálculo.

source: Dominant Colors Lazy Loading Settings
pt_pt: Definições do Dominant Colors Lazy Loading

source: Format
pt_pt: Formato

source: Fallback
pt_pt: Por omissão

source: If you want to preserve the aspect ratio of responsive images enable SVG placeholders.<br>If you care about transferred bytes, browser compatibility or preserve the aspect ratio yourself use GIF placeholders.<br>If you want to use tiny thumbnails you also have to use GIF placeholders.
pt_pt: Se quiser preservar as proporções de imagens responsivas, active os <em>placeholders</em> SVG.<br>Se quiser garantir as proporções das imagens e a sua prioridade for minimizar os bytes transferidos e compatibilidade com navegadores, utilize os <em>placeholders</em> GIF.<br>Se quiser usar minaturas muito pequenas também terá que usar os <em>placeholders</em> GIF.

source: <strong>SVG</strong> (More bytes, preserves image aspect ratio)
pt_pt: <strong>SVG</strong> (mais bytes, preserva as proporções da imagem)

source: <strong>GIF</strong> (Less bytes, compatible with ancient browsers)
pt_pt: <strong>GIF</strong> (menos bytes, compatível com navegadores mais antigos)

source: <strong>GIF with 3×3 pixels</strong> (Tiny thumbnail with 120 bytes)
pt_pt: <strong>GIF com 3× 3 píxeis</strong> (Miniaturas muito pequenas com 120 bytes)

source: <strong>GIF with 4×4 pixels</strong> (Tiny thumbnail with 128 bytes)
pt_pt: <strong>GIF com 4× 4 píxeis</strong> (Miniaturas muito pequenas com 128 bytes)

source: <strong>GIF with 5×5 pixels</strong> (Tiny thumbnail with 204 bytes)
pt_pt: <strong>GIF com 4× 4 píxeis</strong> (Miniaturas muito pequenas com 204 bytes)

source: Calculation
pt_pt: Cálculo

source: %s image has no dominant color assigned or is missing tiny thumbnails.
pt_pt: %s imagem sem cor dominante atribuída ou sem miniaturas muito pequenas.

source: Do you want to calculate now?
pt_pt: Quer calcular agora?

source: Calculate
pt_pt: Calcular

source: ImageMagick PHP extension was not detected.
pt_pt: A extensão de PHP ImageMagick não foi detectada.

source: This plugin allows you to lazy load your images while showing the dominant color of each image as a placeholder – like Pinterest or Google Images.
pt_pt: Este plugin permite-lhe apresentar a cor dominante de cada imagem como <em>placeholder</em>, enquanto carrega as imagens - como o Pinterest ou Google Images.
